artillery/test.yml
config:
  target: "https://placekeanu.com/"
  phases:
    - duration: 10
      arrivalRate: 10
      name: Artillery First Test
    - duration: 10
      arrivalRate: 20
      name: Artillery Second Test
    - duration: 10
      arrivalRate: 30
      name: Artillery Third Test
  payload:
    -
      path: "keywords.csv"
      fields:
        - "fruit"
        - "car"
      order: sequence
      skipHeader: false
      cast: false
      skipEmptyLines: true
  plugins:
    ensure:
      thresholds:
        - http.response_time.p95: 10
        - http.response_time.max: 2000
        - http.counts.status.200: 1000
      conditions:
        - expression: "http.request_rate >= 2 and http.response_time.max < 600"
  # payload:
  #   -
  #     path: "keywords.csv"
  #     fields:
  #       - "keyword1"
  #       - "keyword2"
  #     order: sequence

scenarios:
  - name: Getting a resource
    flow:
      - get:
          url: "{{ target }}get"
      - post:
          url: "{{ target }}post"
          json:
            name: "Test User"
            password: "Temp Password"
          capture:
            - json: "$.json"
              as: "request_body"
            - json: "$.headers.Host"
              as: "host"
      - log: "Json value from response is: {{ request_body }}"
      - log: "Host value from response is {{ host }}"